cpp/examples/thirdPartyLibraryExamples/gsoapExamples/jetlun/JetlunHan.startGwModule.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:hs="urn:JetlunHan">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
  <hs:startGwModule>
   <request>
    <admissionMode>0</admissionMode>
    <size>0</size>
   </request>
  </hs:startGwModule>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
